In [93]:
import pandas as pd

# Series

In [94]:
data = [ 1, 2, 3, 4, 5]

In [95]:
s = pd.Series(data)

In [96]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [97]:
index = ['Linha' + str(i) for i in range(5)]

In [98]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [99]:
s = pd.Series(data = data, index = index)

In [100]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [101]:
data = {'Linha' + str(i) : i + 1 for i in range(5)}

In [102]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [103]:
s = pd.Series(data)

In [104]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [105]:
s1 = s + 2

In [106]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [107]:
s2 = s + s1
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

# DataFrame

In [108]:
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

In [109]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [110]:
df1 = pd.DataFrame(data = data)

In [111]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [112]:
index = ['Linha' + str(i) for i in range(3)]

In [113]:
index

['Linha0', 'Linha1', 'Linha2']

In [114]:
df1 = pd.DataFrame(data = data, index = index)

In [115]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [116]:
columns = ['Coluna' + str(i) for i in range(3)]
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [117]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)

In [118]:
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [119]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [120]:
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [121]:
df2 = pd.DataFrame(data)

In [122]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [123]:
data = [(1, 2, 3),
        (4, 5, 6),
        (7, 8, 9)]

In [124]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [125]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [126]:
df1[df1 > 0] = 'A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [127]:
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [128]:
df3[df3 > 0] = 'C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [129]:
df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [130]:
df1.columns = ['Coluna0', 'Coluna1', 'Coluna2']

In [131]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C